{"animations/boids":{"slug":"animations/boids","filePath":"animations/boids.md","title":"boids flocking","links":[],"tags":[],"content":"\n\n                  \n                  Coming soon! \n                  \n                \n\nThis animation and a technical explanation of the math behind it is being written as we speak. Check back soon!\n\n\n"},"animations/index":{"slug":"animations/index","filePath":"animations/index.md","title":"animations","links":[],"tags":[],"content":"Here lies a list of animations and interactive visualisations I have made. Some of these are even used as the background of this site!\nMost of these animations have a mathematical theme and were coded in p5.js. Click on an animation to find out more about it, how it was coded, where I got the inspiration and a link to play with the code yourself.\nHave fun!"},"animations/keys":{"slug":"animations/keys","filePath":"animations/keys.md","title":"bouncing keys","links":[],"tags":[],"content":"\n\n                  \n                  Coming soon! \n                  \n                \n\nThis animation is available to check out now at the p5.js web editor. A technical explanation of the workings behind the animation are being written as we speak. Check back soon!\n\n\nTry it out for yourself\n\n"},"animations/reacdiff":{"slug":"animations/reacdiff","filePath":"animations/reacdiff.md","title":"reaction-diffusion","links":[],"tags":[],"content":"\n\n\n                  \n                  Coming soon! \n                  \n                \n\nThis animation is under development. Check back soon!\n\n\n\n"},"animations/slime":{"slug":"animations/slime","filePath":"animations/slime.md","title":"physarum","links":[],"tags":[],"content":"This animation explores the study of biological computing, specifically the foraging behaviour of the Physarum polycephalum slime mould, which is famous for its ability to optimise pathways across its network. The inspiration for this animation came from Patt Vira’s video on the topic, who herself was inspired by Jeff Jones’s algorithm.\nThe math\nThe simulation is an agent-based model where emergent complexity arises from three mathematical stages — sensing, steering and decaying.\nSensing\nEach agent possesses a heading θ(t) and three sensors (left, forward, right) positioned at a distance d from the agent. The spatial coordinates for a sensor at offset angle ϕ are calculated using\ns_x=a_x+d\\cos(θ+ϕ)\\\\\ns_y=a_y+d\\sin(θ+ϕ)\nwhere s is a sensor and a is the agent. The agent “samples” the trail map at these coordinates to determine the local pheromone concentration C.\nSteering\nThe agent’s movement is governed by a simple steering rule based on the sampled concentrations C_L, C_F, and C_R. To decide the next heading θ(t+1), the agent follows the gradient of the highest concentration.\nIf C_F &gt; C_L and C_F &gt; C_R, the agent continues straight, so Δθ=0. If C_F &lt; C_L and C_F &lt; C_R, the agent randomly rotates either left or right by the rotation angle α. Otherwise, it rotates toward the side with the higher concentration.\nDecay\nThe environment itself is a dynamic grid. Every frame, the pheromone map undergoes two processes — deposition and decay — to simulate biological dissipation, with an option third step, diffusion.\nAs an agent moves to a new pixel, it increases that pixel’s intensity\nC_{new} = C_{old}+ScentStrength\nthrough a process called deposition. Then, to prevent the map from saturating, every pixel value is multiplied by a decay factor γ (where 0&lt;γ&lt;1).\nC(t+1)=C(t)γ\nTo create smoother paths, the values are then optionally often diffused by averaging them with their neighbours using a Laplacian-like kernel, simulating the natural spreading of chemicals through a medium.\nPlay with the code!\nSee the code, change the parameters and try creating your very own Physarum network in the p5.js web editor.\n"},"animations/voronoi":{"slug":"animations/voronoi","filePath":"animations/voronoi.md","title":"voronoi tesselation","links":[],"tags":[],"content":"\n\n                  \n                  Coming soon! \n                  \n                \n\nThis animation and a technical explanation of it’s workings are being developed as we speak. Check back soon!\n\n\n"},"applications/QADDOE":{"slug":"applications/QADDOE","filePath":"applications/QADDOE.md","title":"QADDOE","links":["Qualitative-Data-Analysis","Université-du-Québec-à-Trois-Rivières"],"tags":[],"content":"\n\nQADDOE is a free, open-source desktop Qualitative Data Analysis application that runs on Windows, Mac and Linux. Designed by and for researchers, QADDOE offers a powerful qualitative coding workflow, integral document security and code management without the overhead of unnecessary features.\n\n\n                  \n                  Getting Started \n                  \n                \n\nYou can download the latest version here or view the source code on GitHub.\nGot any questions? Take a peek at the documentation or get in touch.\n\n\nHow QADDOE came to be\nThe idea for QADDOE grew out of a shared frustration. While working alongside a professor and one of his PhD students at the Université du Québec à Trois-Rivières, I saw first-hand how the current state of qualitative data analysis software was holding researchers back. For years, the industry-standard tools have become increasingly bloated and slow. More concerning, however, is how restrictive they’ve become — not just by locking users into their ecosystems and export formats, but by forcing researchers to adopt the company’s own opinionated workflows. Researchers shouldn’t have to fight their tools to get their work don, so we decided to build a alternative.\nOur design ethos\nOur philosophy is built on the idea that software should facilitate research rather than dictate it. We embrace a sense of feature-minimalism, focusing entirely on the essential tools needed for rigorous coding and analysis. By avoiding unnecessary features that clutter the interface, we leave the actual control in your hands.\nCentral to this is the belief that your data should always remain yours. We use open export formats and rely on markdown files (which are essentially text files with formatting) that can be read by any text program. This ensures that your project can be moved to any other software at any time without friction.\nWe believe the true power of analysis lies with the researcher. Our goal is to empower the user by keeping the software free of charge, easy to use, and open to everyone. Analysis shouldn’t be a privilege reserved for those with the big budgets. We are committed to continuous improvement, constantly evolving QADDOE to be more intuitive while staying true to the needs of the people using it.\nWe do not, and never will, incorporate AI into QADDOE.\nOur mission\nTo democratize analysis by providing an affordable, user-friendly tool that empowers researchers of all backgrounds to turn raw data into meaningful insights. We are dedicated to breaking down the barriers that usually limit analysis, whether those are related to age, location, education, or financial resources.\nWe strongly believe the user should always be in total control to decide which questions to ask and how to interpret their findings. We also believe in future-proofing your work; your data will always be accessible regardless of which software you choose to use in the future. Ultimately, we want to build a community of informed minds where anyone can leverage the power of analysis for a deeper understanding of the world. By upholding these values, we aim to make the entire research experience more accessible and empowering for everyone.\nWhat’s coming up\nThe application is currently in its beta phase, but we are moving quickly toward the release of version 1. This is a major milestone for the project and will introduce several significant changes. We are launching a brand new interface that has been redesigned from the ground up to provide better focus and clarity while you work. We are also focusing on improving the overall conviviality of the app to ensure the learning curve is much shallower for those new to the field. Finally, we have implemented significant speed optimizations to ensure that QADDOE stays lightweight and fast, even as your research projects grow in size and complexity."},"applications/index":{"slug":"applications/index","filePath":"applications/index.md","title":"applications","links":[],"tags":[],"content":"This page serves as a reference for a desktop applications that I have developed and published."},"computational-linguistics":{"slug":"computational-linguistics","filePath":"computational linguistics.md","title":"computational linguistics","links":[],"tags":[],"content":"In the study of linguistics, computational linguistics is an interdisciplinary field that combines linguistics and computer science to analyse and understand human language using computational methods.\nThere are two main applications for computational linguistics, (a) helping computers process and generate language as humans do, through tasks such as machine translation, speech recognition, and sentiment analysis; and (b) helping humans understand the intrinsic properties of a language by, for example, meta-analysis of the languages morphemes. \n"},"cv":{"slug":"cv","filePath":"cv.md","title":"cv","links":["applications/QADDOE","projects/TEFL-Level-5-course"],"tags":[],"content":"\nEnglish Tutor ・ Software Developer ・ Learning Information Specialist\n📍 UK ・ Canada ・ Japan\n📧 ross@reiwa.ca\nAvailable for remote-freelance and hired work\nLooking to develop natural, native-like English skills? Get in touch to book a trial lesson with me today!\n\n\n                  \n                  Professional Summary \n                  \n                \n\nMultilingual educator and software developer focused on intuitive, real-world English fluency. Looking to pursue an MLIS (Master’s in Library &amp; Information Science) to apply research-led data organization methodologies to ESL curriculum design. Specializing in bridging the gap between technical complexity and accessible learning, concentrating on C1-level French support, neurodivergent-friendly pedagogy, and real-world readiness for international professionals.\n\n\n\nSkills &amp; Technical Proficiencies\n\nEducation &amp; Linguistics: ESL Pedagogy, Curriculum design, Bilingual instruction, Neurodivergent-adaptive teaching.\nProgramming &amp; Frameworks: Electron (JS/TS), p5.js, AHK Automation, HTML/CSS, Python.\nTechnical: Software development, Technical problem solving, Data management, Analytical skills.\nSoft Skills: Client collaboration, 90+ WPM typing, Technical training, Multi-timezone coordination.\nLanguages: English (Native), French (Professional Proficiency — CEFR C1).\n\n\nWork Experience\nEnglish Tutor ・ Freelance\nKyoto, Japan ・ December 2025 — Present\n\nDevelop and deliver personalised ESL lessons for international students across a range of levels from foundational literacy to advanced academic essay writing and professional fluency.\nAdapt teaching methodologies for neurodivergent and visual learners, utilizing hand-made interactive games and puzzles to make complex grammatical logic intuitive and engaging.\nLeverage research skills to curate, organize and provide high-quality, accessible digital learning resources and databases for students.\nUtilize C1-level French proficiency to provide nuanced, L1-supported instruction for Francophone beginners.\nImplement “Perfect Practice” frameworks to identify and correct phonetic and grammatical mistakes in real-time.\nFacilitate real-world readiness by teaching high-frequency idioms, collocations and cultural nuances.\n\nSoftware Developer ・ Reiwa Software Labs\nQuebec, Canada ・ July 2023 — March 2025\n\nSpearheaded development of a custom qualitative data analysis application using Electron (24,000+ SLoC).\nOptimized workflows through reducing data processing time by an estimated 30% for graduate research students.\nDesigned algorithms and data structures resulting in a 15% reduction in loading times.\nFocused on user-centric design, translating complex researcher requirements into tailored software functionalities.\nProvided comprehensive technical training on how to take advantage of the application for best research results.\n\nCollege Teaching Assistant ・ Freelance\nQuebec, Canada ・ December 2022 — June 2023\n\nMarked hundreds of exams and assignments, providing constructive feedback based on detailed rubrics.\nSupported faculty and students in delivering seminars on the effective use of college software and digital tools.\n\nResearch Assistant ・ PhD Thesis Project\nRemote (UK &amp; Canada) ・ December 2021 — June 2023\n\nCollaborated globally, assisting researchers across 3+ time zones (France, Canada and Japan).\nSecurely managed highly sensitive, confidential documents ensuring 100% availability while upholding strict security and encryption standards.\n\n\nEducation\nBSc (Hons) Computer Science &amp; Mathematics\nOpen University ・ Online ・ 2020 — 2022\n\nFocus: Differential Equations, Mathematical Programming, Algorithms &amp; Data Structures.\nCultivated rigorous self-study habits and applied theoretical knowledge to computational tasks.\n\nBSc (Hons) Mathematics\nUniversity of Aberdeen ・ UK ・ 2017 — 2019\n\nFocus: Calculus, Linear Algebra, Set Theory, Analysis.\n\n\n\nProjects\n\nMaintainer, QADDOE (reiwa.ca/qaddoe) – Lead maintainer for qualitative data tools.\nDesigner, Serial Steno Typing Theory – Developing advanced typing methodologies (Sept 2023 — Present).\n\n\nCertificates\n\nLevel 5 TEFL Diploma ・ Advanced certification in English as a Foreign Language.\nCertified Cybersecurity Analyst ・ IBM (August — December 2021)\n"},"games/index":{"slug":"games/index","filePath":"games/index.md","title":"games","links":[],"tags":[],"content":""},"guestbook":{"slug":"guestbook","filePath":"guestbook.md","title":"guestbook","links":["projects","media","Braille"],"tags":[],"content":"Thank you for visiting! Please feel free to leave a note, I’d love to hear from you.\n\n\n                  \n                  A foreword... \n                  \n                \n\nI prefer organic entries over automated ones — no bots allowed. Feel free to leave feedback on my projects, suggest a book for my reading list, or just say bonjour. If you encounter a bug or an accessibility barrier (especially regarding screen readers or Braille compatibility), you can let me know here or, alternatively, email me.\n\n\n\n\n                  \n                  Oh, and... \n                  \n                \n\nTo keep this form from abuse, I manually approve entries. Please be aware that if your message is helpful, kind, or interesting, it may be archived here permanently.\n\n\nSign the log!\n\n  iframe[data-tally-src] {\n    background: transparent !important;\n    color-scheme: normal;\n  }\n\n\n\n"},"index":{"slug":"index","filePath":"index.md","title":"Welcome!","links":["projects/TEFL-Level-5-course","computational-linguistics","Braille","projects","tools","media","research","publications","Japan","cv","guestbook"],"tags":[],"content":"\n\n\nI’m Ross, an information architect-in-training who enjoys mathematics, coding, automating things, and exploring the many interfaces between humans and machines. I’m a strong advocate for free, open and accessible education for everyone.\nI’m currently studying for the TEFL Level 5 diploma. \nMy background is in Mathematics &amp; Computer Science, specifically computational linguistics. I’d like to pursue a Master’s in Library &amp; Information Sciences at l’Université de Montréal to research the differences in the implementation of Braille across international writing systems.\n\n\nThis website serves as a central reference hub for information on projects I’m working on, tools I’ve created, media I’m consuming as well as notes and documentation on my personal research and  publications. \n\nI’m currently in 🇯🇵 Japan. I’m available for both remote-freelance and hired work — interact with my CV or get in touch.\nWant to drop a digital note? Sign the guestbook!\n\nInformation hoarder? Did you mean “curator of high-density knowledge”…\n\n⠊　⠇⠕⠧⠑　⠃⠗⠁⠊⠇⠇⠑\n"},"projects/TEFL-Level-5-course":{"slug":"projects/TEFL-Level-5-course","filePath":"projects/TEFL Level 5 course.md","title":"TEFL Level 5 course","links":[],"tags":[],"content":"I’m currently working towards the TEFL Level 5 diploma with the goal of being able to teach English to students internationally. It consists of 10 units and 3 written assessments. I started this course on the 20th January 2026.\n\n\n                  \n                  Completion rate \n                  \n                \n\n27/54 (50.0%)\n\n\nUnits\n\n Unit 1 — Introduction to lesson planning\n Unit 2 — Teaching vocabulary\n Unit 3 — Teaching pronunciation\n Unit 4 — Understanding grammar\n Unit 5 — Teaching listening and reading\n Unit 6 — Teaching speaking and writing\n Unit 7 — Teaching grammar\n Unit 8 — A history of the English language\n Unit 9 — Teaching materials and classroom management strategies\n Unit 10 — The effective use of resources\n\nAssessments\n\n A\n B\n C\n"},"projects/index":{"slug":"projects/index","filePath":"projects/index.md","title":"projects","links":[],"tags":[],"content":"Below is a list of projects I’m actively working on. I have many more projects in the works which will be added here in due time. Completed projects don’t appear here yet."},"publications/index":{"slug":"publications/index","filePath":"publications/index.md","title":"publications","links":[],"tags":[],"content":""},"research/index":{"slug":"research/index","filePath":"research/index.md","title":"research","links":[],"tags":[],"content":""},"tools/index":{"slug":"tools/index","filePath":"tools/index.md","title":"tools","links":[],"tags":[],"content":""}}